In [222]:
Exploratory Data Analyst

SyntaxError: invalid syntax (3348524043.py, line 1)

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

# Shows plots in jupyter notebook
%matplotlib inline

# Set plot style
sns.set(color_codes=True)

import numpy as np

In [ ]:
transaction=pd.read_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/transactions.csv')

In [ ]:
address=pd.read_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/customeraddress.csv')

In [286]:
demographic=pd.read_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/customerdemographic.csv')

In [ ]:
#Clean Transaction data

In [ ]:
transaction.info()

In [202]:
transaction['online_order']=(transaction['online_order']=='True').astype(int)

In [200]:
transaction.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order                 0
order_status                 0
brand                        0
product_line                 0
product_class              197
product_size                 0
list_price                   0
standard_cost              176
product_first_sold_date      0
product_calss                0
dtype: int64

In [173]:
#sort columns by customer id and transaction date
transaction=transaction.sort_values(['customer_id','transaction_date'])

In [174]:
#count online orders
transaction['online_order'].value_counts()

True     9829
False    9811
Name: online_order, dtype: int64

In [175]:
transaction['online_order']=transaction['online_order'].fillna(method='bfill')

In [176]:
transaction['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [177]:
transaction['brand']=transaction['brand'].fillna(method='ffill')

In [178]:
transaction['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [179]:
transaction['product_line']=transaction['product_line'].fillna(method='bfill')

transaction['product_calss'].value_counts()

In [180]:
transaction['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [190]:
transaction['product_calss']=transaction['product_class'].fillna(method='bfill')

In [191]:
transaction['product_size'].value_counts()

medium    13113
large      4022
small      2865
Name: product_size, dtype: int64

In [192]:
transaction['product_size']=transaction['product_size'].fillna(method='ffill')

In [194]:
transaction['standard_cost'] = transaction['standard_cost'].astype(str).astype(float)

In [195]:
meancost=transaction.groupby(['customer_id']).mean().round(decimals=2)
meancost

,transaction_id,product_id,online_order,list_price,standard_cost,product_first_sold_date
customer_id,,,,,,
1,"11,485.64",34.18,0.55,825.86,551.49,"37,314.09"
2,"8,471.67",37.33,0.33,"1,383.02",640.94,"38,775.67"
3,"13,842.62",60.38,0.12,"1,236.03",815.68,"39,350.25"
4,"13,544.50",78.50,0.50,523.86,413.58,"36,008.50"
5,"7,969.67",48.17,0.33,983.87,584.71,"37,361.00"
...,...,...,...,...,...,...
3497,"8,565.00",32.33,0.67,"1,248.02",698.58,"38,680.33"
3498,"9,327.50",72.17,0.83,862.84,338.29,"37,723.67"
3499,"6,871.29",42.71,0.57,"1,096.21",388.32,"38,163.86"
3500,"10,076.00",40.00,0.33,820.40,522.76,"36,432.50"
5034,"14,292.67",0.00,0.00,506.64,416.81,"37,254.67"

In [196]:
transaction['standard_cost']=transaction['standard_cost'].fillna(meancost.standard_cost)

In [197]:
transaction['product_first_sold_date']=transaction['product_first_sold_date'].fillna(transaction['product_first_sold_date'].mean())

In [218]:
transaction['product_class'].replace('', np.nan, inplace=True)

In [219]:
transaction.dropna(subset=['product_class'], inplace=True)

In [225]:
transaction['transaction_date']=pd.to_datetime(transaction['transaction_date'])

In [228]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19803 entries, 9784 to 8707
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19803 non-null  int64
 1   product_id               19803 non-null  int64
 2   customer_id              19803 non-null  int64
 3   transaction_date         19803 non-null  datetime64[ns]
 4   online_order             19803 non-null  int64
 5   order_status             19803 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               19803 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
 13  product_calss            19803 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(4), object(6)
memory usage: 2.3+ MB

In [227]:
transaction.to_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/transaction_clean.csv',index=False)

In [ ]:
#Clean demographic table

In [287]:
demographic['DOB']=pd.to_datetime(demographic['DOB'])

In [288]:
demographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3998 entries, 0 to 3997
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3998 non-null   int64
 1   first_name                           3998 non-null   object
 2   last_name                            3873 non-null   object
 3   gender                               3998 non-null   object
 4   past_3_years_bike_related_purchases  3998 non-null   int64
 5   DOB                                  3911 non-null   datetime64[ns]
 6   job_title                            3492 non-null   object
 7   job_industry_category                3342 non-null   object
 8   wealth_segment                       3998 non-null   object
 9   deceased_indicator                   3998 non-null   object
 10  owns_car                             3998 non-null   object
 11  tenure                               3911 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 374.9+ KB

In [289]:
demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,3,Arlin,Dearle,Male,61,2054-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.00
1,4,Talbot,NaN,Male,33,2061-10-03,NaN,IT,Mass Customer,N,No,7.00
2,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.00
3,6,Curr,Duckhouse,Male,35,2066-09-16,NaN,Retail,High Net Worth,N,Yes,13.00
4,7,Fina,Merali,Female,6,1976-02-23,NaN,Financial Services,Affluent Customer,N,Yes,11.00

In [290]:
demographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [291]:
demographic['last_name']=demographic.groupby('first_name').last_name.bfill().ffill()

In [292]:
demographic['gender'].value_counts()

Female    2037
Male      1871
U           88
Femal        1
M            1
Name: gender, dtype: int64

In [293]:
demographic['gender'].replace(to_replace='Femal',value='Female',inplace=True)

In [294]:
demographic['gender'].replace(to_replace='M',value='Male',inplace=True)

In [295]:
demographic['gender'].value_counts()

Female    2038
Male      1872
U           88
Name: gender, dtype: int64

In [296]:
#check if all dates are in correct format
demographic['DOB']=demographic['DOB'].dt.date
demographic['DOB']

0       2054-01-20
1       2061-10-03
2       1977-05-13
3       2066-09-16
4       1976-02-23
           ...
3993    1975-08-09
3994    2001-07-13
3995           NaT
3996    1973-10-24
3997    1991-11-05
Name: DOB, Length: 3998, dtype: object

In [298]:
demographic['DOB']=demographic['DOB'].fillna(lambda x: np.random.choice(demographic['DOB'],inplace=True))

In [299]:
demographic['job_title'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Database Administrator II                4
Health Coach III                         3
Health Coach I                           3
Research Assistant III                   3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [300]:
demographic['job_title']=demographic['job_title'].fillna(method='bfill')

In [301]:
demographic['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    773
Health                601
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [302]:
demographic['job_industry_category']=demographic['job_industry_category'].fillna(method='bfill')

In [304]:
demographic['tenure'].value_counts()

7.00     235
5.00     228
11.00    220
10.00    218
16.00    214
8.00     211
18.00    208
12.00    202
14.00    200
9.00     200
6.00     192
13.00    191
4.00     191
17.00    182
15.00    179
1.00     166
3.00     160
19.00    159
2.00     150
20.00     96
22.00     55
21.00     54
Name: tenure, dtype: int64

In [308]:
demographic['tenure']=demographic['tenure'].fillna(demographic['tenure'].median())

In [315]:
demographic['job_industry_category'].value_counts()

Manufacturing         969
Financial Services    939
Health                707
Retail                423
Property              315
IT                    265
Entertainment         164
Argiculture           127
Telecommunications     88
Name: job_industry_category, dtype: int64

In [316]:
demographic.dropna(subset=['job_industry_category'], inplace=True)

In [318]:
demographic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3997 entries, 0 to 3996
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3997 non-null   int64
 1   first_name                           3997 non-null   object
 2   last_name                            3997 non-null   object
 3   gender                               3997 non-null   object
 4   past_3_years_bike_related_purchases  3997 non-null   int64
 5   DOB                                  3997 non-null   object
 6   job_title                            3997 non-null   object
 7   job_industry_category                3997 non-null   object
 8   wealth_segment                       3997 non-null   object
 9   deceased_indicator                   3997 non-null   object
 10  owns_car                             3997 non-null   object
 11  tenure                               3997 non-null   float64
dtypes: float64(1), int64(2), object(9)
memory usage: 405.9+ KB

In [319]:
demographic.to_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/demographic_clean.csv',index=False)

In [ ]:
#clean address table

In [322]:
address.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [323]:
address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [324]:
address['country'].value_counts()

Australia    3999
Name: country, dtype: int64

In [325]:
address['property_valuation'].value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

In [326]:
address['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [329]:
address['state']=address['state'].replace({'New South Wales':'NSW','Victoria':'VIC'})

In [330]:
address['state'].value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [331]:
#check duplicate
pd.Series(address['customer_id']).is_unique

True

In [334]:
address.duplicated(subset=['address','postcode'],keep='first').value_counts()

False    3999
dtype: int64

In [335]:
address.to_csv('/Users/xuyangzhang/Desktop/FORAGE PROGRAM/kpmg/address_clean.csv',index=False)